avr-rust/avrd/packs/tiny/ATtiny5.atdf
        <register caption="Timer/Counter0 " name="TCNT0" offset="0x28" size="2" mask="0xFFFF"/>
        <register caption="Timer/Counter 0 Output Compare Register A " name="OCR0A" offset="0x26" size="2" mask="0xFFFF"/>
        <register caption="Timer/Counter0 Output Compare Register B " name="OCR0B" offset="0x24" size="2" mask="0xFFFF"/>
        <register caption="Input Capture Register  Bytes" name="ICR0" offset="0x22" size="2" mask="0xFFFF"/>
        <register caption="Timer Interrupt Mask Register 0" name="TIMSK0" offset="0x2B" size="1">
          <bitfield caption="Input Capture Interrupt Enable" mask="0x20" name="ICIE0"/>
          <bitfield caption="Output Compare B Match Interrupt Enable" mask="0x04" name="OCIE0B"/>
          <bitfield caption="Output Compare A Match Interrupt Enable" mask="0x02" name="OCIE0A"/>
          <bitfield caption="Overflow Interrupt Enable" mask="0x01" name="TOIE0"/>
        </register>
        <register caption="Overflow Interrupt Enable" name="TIFR0" offset="0x2A" size="1">
          <bitfield caption="Input Capture Flag" mask="0x20" name="ICF0"/>
          <bitfield caption="Timer Output Compare Flag 0B" mask="0x04" name="OCF0B"/>
          <bitfield caption="Timer Output Compare Flag 0A" mask="0x02" name="OCF0A"/>
          <bitfield caption="Timer Overflow Flag" mask="0x01" name="TOV0"/>
        </register>
        <register caption="General Timer/Counter Control Register" name="GTCCR" offset="0x2F" size="1">
          <bitfield caption="Timer Synchronization Mode" mask="0x80" name="TSM"/>
          <bitfield caption="Prescaler Reset" mask="0x01" name="PSR"/>
        </register>
      </register-group>
      <value-group caption="" name="CLK_SEL_3BIT_EXT">
        <value caption="No Clock Source (Stopped)" name="VAL_0x00" value="0x00"/>
        <value caption="Running, No Prescaling" name="VAL_0x01" value="0x01"/>
        <value caption="Running, CLK/8" name="VAL_0x02" value="0x02"/>
        <value caption="Running, CLK/64" name="VAL_0x03" value="0x03"/>
        <value caption="Running, CLK/256" name="VAL_0x04" value="0x04"/>
        <value caption="Running, CLK/1024" name="VAL_0x05" value="0x05"/>
        <value caption="Running, ExtClk Tx Falling Edge" name="VAL_0x06" value="0x06"/>
        <value caption="Running, ExtClk Tx Rising Edge" name="VAL_0x07" value="0x07"/>
      </value-group>
    </module>
    <module caption="Watchdog Timer" name="WDT">
      <register-group caption="Watchdog Timer" name="WDT">
        <register caption="Watchdog Timer Control and Status Register" name="WDTCSR" offset="0x31" size="1">
          <bitfield caption="Watchdog Timer Interrupt Flag" mask="0x80" name="WDIF"/>
          <bitfield caption="Watchdog Timer Interrupt Enable" mask="0x40" name="WDIE"/>
          <bitfield caption="Watchdog Timer Prescaler Bits" mask="0x27" name="WDP" values="WDOG_TIMER_PRESCALE_4BITS"/>
          <bitfield caption="Watch Dog Enable" mask="0x08" name="WDE"/>
        </register>
      </register-group>
      <value-group caption="" name="WDOG_TIMER_PRESCALE_4BITS">
        <value caption="Oscillator Cycles 2K" name="VAL_0x00" value="0x00"/>
        <value caption="Oscillator Cycles 4K" name="VAL_0x01" value="0x01"/>
        <value caption="Oscillator Cycles 8K" name="VAL_0x02" value="0x02"/>
        <value caption="Oscillator Cycles 16K" name="VAL_0x03" value="0x03"/>
        <value caption="Oscillator Cycles 32K" name="VAL_0x04" value="0x04"/>
        <value caption="Oscillator Cycles 64K" name="VAL_0x05" value="0x05"/>
        <value caption="Oscillator Cycles 128K" name="VAL_0x06" value="0x06"/>
        <value caption="Oscillator Cycles 256K" name="VAL_0x07" value="0x07"/>
        <value caption="Oscillator Cycles 512K" name="VAL_0x08" value="0x08"/>
        <value caption="Oscillator Cycles 1024K" name="VAL_0x09" value="0x09"/>
      </value-group>
    </module>
  </modules>
  <pinouts>
    <pinout name="SOT23_6">
      <pin pad="PB0" position="1"/>
      <pin pad="GND" position="2"/>
      <pin pad="PB1" position="3"/>
      <pin pad="PB2" position="4"/>
      <pin pad="VCC" position="5"/>
      <pin pad="PB3" position="6"/>
    </pinout>
    <pinout name="UDFN8">
      <pin pad="PB1" position="1"/>
      <pin pad="GND" position="4"/>
      <pin pad="PB0" position="5"/>
      <pin pad="PB3" position="6"/>
      <pin pad="VCC" position="7"/>
      <pin pad="PB2" position="8"/>
    </pinout>
  </pinouts>
</avr-tools-device-file>
